addons/binding/org.openhab.binding.ihc.test/src/test/resources/SuccesfulLoginResponse.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Body>
<ns1:authenticate2 xmlns:ns1="utcs" xsi:type="ns1:WSLoginResult">
<ns1:loggedInUser xsi:type="ns1:WSUser">
<ns1:createdDate xsi:type="ns1:WSDate">
<ns1:day xsi:type="xsd:int">13</ns1:day>

<ns1:monthWithJanuaryAsOne xsi:type="xsd:int">4</ns1:monthWithJanuaryAsOne>

<ns1:hours xsi:type="xsd:int">19</ns1:hours>

<ns1:minutes xsi:type="xsd:int">43</ns1:minutes>

<ns1:seconds xsi:type="xsd:int">9</ns1:seconds>

<ns1:year xsi:type="xsd:int">2018</ns1:year>
</ns1:createdDate>

<ns1:loginDate xsi:type="ns1:WSDate">
<ns1:day xsi:type="xsd:int">28</ns1:day>

<ns1:monthWithJanuaryAsOne xsi:type="xsd:int">6</ns1:monthWithJanuaryAsOne>

<ns1:hours xsi:type="xsd:int">20</ns1:hours>

<ns1:minutes xsi:type="xsd:int">2</ns1:minutes>

<ns1:seconds xsi:type="xsd:int">28</ns1:seconds>

<ns1:year xsi:type="xsd:int">2018</ns1:year>
</ns1:loginDate>

<ns1:username xsi:type="xsd:string">user</ns1:username>

<ns1:password xsi:type="xsd:string">pass</ns1:password>

<ns1:email xsi:type="xsd:string" xsi:nil="true">
</ns1:email>

<ns1:firstname xsi:type="xsd:string" xsi:nil="true">
</ns1:firstname>

<ns1:lastname xsi:type="xsd:string" xsi:nil="true">
</ns1:lastname>

<ns1:phone xsi:type="xsd:string" xsi:nil="true">
</ns1:phone>

<ns1:group xsi:type="ns1:WSUserGroup">
<ns1:type xsi:type="xsd:string">text.usermanager.group_administrators</ns1:type>
</ns1:group>

<ns1:project xsi:type="xsd:string" xsi:nil="true">
</ns1:project>
</ns1:loggedInUser>

<ns1:loginWasSuccessful xsi:type="xsd:boolean">true</ns1:loginWasSuccessful>

<ns1:loginFailedDueToConnectionRestrictions xsi:type="xsd:boolean">false</ns1:loginFailedDueToConnectionRestrictions>

<ns1:loginFailedDueToInsufficientUserRights xsi:type="xsd:boolean">false</ns1:loginFailedDueToInsufficientUserRights>

<ns1:loginFailedDueToAccountInvalid xsi:type="xsd:boolean">false</ns1:loginFailedDueToAccountInvalid>
</ns1:authenticate2>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>