bundles/org.openhab.binding.ihc/src/test/resources/LoginFailedResponse.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Body>
<ns1:authenticate2 xmlns:ns1="utcs" xsi:type="ns1:WSLoginResult">
<ns1:loggedInUser xsi:nil="true" xsi:type="ns1:WSUser">
</ns1:loggedInUser>

<ns1:loginWasSuccessful xsi:type="xsd:boolean">false</ns1:loginWasSuccessful>

<ns1:loginFailedDueToConnectionRestrictions xsi:type="xsd:boolean">false</ns1:loginFailedDueToConnectionRestrictions>

<ns1:loginFailedDueToInsufficientUserRights xsi:type="xsd:boolean">false</ns1:loginFailedDueToInsufficientUserRights>

<ns1:loginFailedDueToAccountInvalid xsi:type="xsd:boolean">true</ns1:loginFailedDueToAccountInvalid>
</ns1:authenticate2>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>