bundles/org.openhab.binding.ihc/src/test/resources/SuccesfulLoginQuery.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Body>
  <authenticate1 xmlns="utcs">
   <password>pass</password>
   <username>user</username>
   <application>treeview</application>
  </authenticate1>
 </soapenv:Body>
</soapenv:Envelope>